# Homebrew taps
tap "no-simpler/tap"

# Version control
brew "git"
brew "git-lfs"
brew "git-cliff"
brew "gh"
brew "yadm"

# Shell
brew "bash"
brew "bash-completion"
brew "zsh"
brew "fish"
brew "tmux"
brew "fzf"

# System
brew "gnupg"
brew "htop"
brew "tree"

# Network
brew "wget"
brew "curl"

# Development
brew "vim"
brew "jq"
brew "yq"
brew "bat"
brew "just"
brew "shellcheck"
brew "node"
brew "python"

# Personal CLIs (own tap)
brew "clc"

# macOS
brew "mas"

# Essential casks, in order of configuration
cask "1password"
cask "1password-cli"
cask "ghostty"
cask "raycast"
cask "bartender"
cask "visual-studio-code"
cask "zed"
cask "soundsource"

# Shell prompts
brew "oh-my-posh"

# Browsers & browsing-related
cask "arc"
cask "brave-browser"
cask "firefox"
cask "google-chrome"
cask "tor-browser"
cask "raindropio"

# Development
cask "gcloud-cli"
cask "jetbrains-toolbox"
cask "orbstack"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-iosevka"
cask "font-iosevka-nerd-font"

# Video
cask "elmedia-player"

# Drivers
cask "logi-options+"
