# Homebrew taps
tap "homebrew/bundle"

# Essential packages
brew "git"
brew "git-lfs"
brew "yadm"
brew "wget"
brew "curl"
brew "htop"
brew "tree"
brew "jq"
brew "tmux"
brew "fzf"
brew "zsh"
brew "gpg"
brew "vim"
brew "mas"

# Essential casks, in order of configuration
cask "1password"
cask "alacritty"
cask "iterm2"
cask "alfred"
cask "bartender"
cask "visual-studio-code"
cask "sizeup"
cask "soundsource"

# Shell prompts
brew "oh-my-posh"
brew "starship"

# Browsers & browsing-related
cask "choosy"
cask "arc"
cask "brave-browser"
cask "firefox"
cask "google-chrome"
cask "tor-browser"
cask "raindropio"

# Development
cask "jetbrains-toolbox"
cask "docker"
cask "google-cloud-sdk"
cask "postman"

# Essential AI
cask "chatgpt"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-iosevka"
cask "font-iosevka-nerd-font"

# Video
cask "stolendata-mpv"

# Drivers
cask "logi-options-plus"
